Revit 2027 API
MacroModule Methods
The MacroModule type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBasicIEnumerator | Returns an enumerator that iterates through a collection.
GetEnumerator | Returns an enumerator that iterates through a collection.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetMacro |  Gets the macro with the give name.
GetMacroModuleIterator |  Returns a Macro module iterator that iterates through the collection.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
MacroModule Class
Autodesk.Revit.DB.Macros Namespace